Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00100.svd
            <register>
               <name>RXESC</name>
               <description>Rx Buffer / FIFO Element Size Configuration</description>
               <addressOffset>0x1BC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0DS</name>
                     <description>Rx FIFO 0 Data Field Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>F0DSSelect</name>
                        <enumeratedValue>
                           <name>DATA8</name>
                           <description>8 byte data field</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA12</name>
                           <description>12 byte data field</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA16</name>
                           <description>16 byte data field</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA20</name>
                           <description>20 byte data field</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA24</name>
                           <description>24 byte data field</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA32</name>
                           <description>32 byte data field</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA48</name>
                           <description>48 byte data field</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA64</name>
                           <description>64 byte data field</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>F1DS</name>
                     <description>Rx FIFO 1 Data Field Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>F1DSSelect</name>
                        <enumeratedValue>
                           <name>DATA8</name>
                           <description>8 byte data field</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA12</name>
                           <description>12 byte data field</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA16</name>
                           <description>16 byte data field</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA20</name>
                           <description>20 byte data field</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA24</name>
                           <description>24 byte data field</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA32</name>
                           <description>32 byte data field</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA48</name>
                           <description>48 byte data field</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA64</name>
                           <description>64 byte data field</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RBDS</name>
                     <description>Rx Buffer Data Field Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RBDSSelect</name>
                        <enumeratedValue>
                           <name>DATA8</name>
                           <description>8 byte data field</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA12</name>
                           <description>12 byte data field</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA16</name>
                           <description>16 byte data field</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA20</name>
                           <description>20 byte data field</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA24</name>
                           <description>24 byte data field</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA32</name>
                           <description>32 byte data field</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA48</name>
                           <description>48 byte data field</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA64</name>
                           <description>64 byte data field</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBC</name>
               <description>Tx Buffer Configuration</description>
               <addressOffset>0x1C0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBSA</name>
                     <description>Tx Buffers Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>NDTB</name>
                     <description>Number of Dedicated Transmit Buffers</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQS</name>
                     <description>Transmit FIFO/Queue Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQM</name>
                     <description>Tx FIFO/Queue Mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXFQS</name>
               <description>Tx FIFO / Queue Status</description>
               <addressOffset>0x1C4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TFFL</name>
                     <description>Tx FIFO Free Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFGI</name>
                     <description>Tx FIFO Get Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQPI</name>
                     <description>Tx FIFO/Queue Put Index</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQF</name>
                     <description>Tx FIFO/Queue Full</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXESC</name>
               <description>Tx Buffer Element Size Configuration</description>
               <addressOffset>0x1C8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBDS</name>
                     <description>Tx Buffer Data Field Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TBDSSelect</name>
                        <enumeratedValue>
                           <name>DATA8</name>
                           <description>8 byte data field</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA12</name>
                           <description>12 byte data field</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA16</name>
                           <description>16 byte data field</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA20</name>
                           <description>20 byte data field</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA24</name>
                           <description>24 byte data field</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA32</name>
                           <description>32 byte data field</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA48</name>
                           <description>48 byte data field</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA64</name>
                           <description>64 byte data field</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBRP</name>
               <description>Tx Buffer Request Pending</description>
               <addressOffset>0x1CC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRP0</name>
                     <description>Transmission Request Pending 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP1</name>
                     <description>Transmission Request Pending 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP2</name>
                     <description>Transmission Request Pending 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP3</name>
                     <description>Transmission Request Pending 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP4</name>
                     <description>Transmission Request Pending 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP5</name>
                     <description>Transmission Request Pending 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP6</name>
                     <description>Transmission Request Pending 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP7</name>
                     <description>Transmission Request Pending 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP8</name>
                     <description>Transmission Request Pending 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP9</name>
                     <description>Transmission Request Pending 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP10</name>
                     <description>Transmission Request Pending 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP11</name>
                     <description>Transmission Request Pending 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP12</name>
                     <description>Transmission Request Pending 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP13</name>
                     <description>Transmission Request Pending 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP14</name>
                     <description>Transmission Request Pending 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP15</name>
                     <description>Transmission Request Pending 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP16</name>
                     <description>Transmission Request Pending 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP17</name>
                     <description>Transmission Request Pending 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP18</name>
                     <description>Transmission Request Pending 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP19</name>
                     <description>Transmission Request Pending 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP20</name>
                     <description>Transmission Request Pending 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP21</name>
                     <description>Transmission Request Pending 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP22</name>
                     <description>Transmission Request Pending 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP23</name>
                     <description>Transmission Request Pending 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP24</name>
                     <description>Transmission Request Pending 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP25</name>
                     <description>Transmission Request Pending 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP26</name>
                     <description>Transmission Request Pending 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP27</name>
                     <description>Transmission Request Pending 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP28</name>
                     <description>Transmission Request Pending 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP29</name>
                     <description>Transmission Request Pending 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP30</name>
                     <description>Transmission Request Pending 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP31</name>
                     <description>Transmission Request Pending 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
