Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00100.svd
            <register>
               <name>ENTRY7</name>
               <description>CoreSight ROM Table Entry 7 Register</description>
               <addressOffset>0x101C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Entry not present</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Entry present</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FMTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>8-bit format</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit format</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEMTYPE</name>
               <description>CoreSight ROM Table Memory Type Register</description>
               <addressOffset>0x1FCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYSMEM</name>
                     <description>CoreSight System Memory Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SYSMEMSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>System memory not present on bus. This is a dedicated debug bus.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>System memory is also present on this bus</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID4</name>
               <description>CoreSight Peripheral Identification 4 Register</description>
               <addressOffset>0x1FD0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DES2</name>
                     <description>CoreSight JEP106 Continuation Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>CoreSight Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID5</name>
               <description>CoreSight Peripheral Identification 5 Register</description>
               <addressOffset>0x1FD4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>CoreSight Reserved Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID6</name>
               <description>CoreSight Peripheral Identification 6 Register</description>
               <addressOffset>0x1FD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>CoreSight Reserved Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID7</name>
               <description>CoreSight Peripheral Identification 7 Register</description>
               <addressOffset>0x1FDC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>CoreSight Reserved Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID0</name>
               <description>CoreSight Peripheral Identification 0 Register</description>
               <addressOffset>0x1FE0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000D0</resetValue>
               <fields>
                  <field>
                     <name>PART0</name>
                     <description>CoreSight Part Number Bits[7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID1</name>
               <description>CoreSight Peripheral Identification 1 Register</description>
               <addressOffset>0x1FE4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000009C</resetValue>
               <fields>
                  <field>
                     <name>PART1</name>
                     <description>CoreSight Part Number Bits[11:8]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DES0</name>
                     <description>CoreSight JEP106 Identification Code Bits [3:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID2</name>
               <description>CoreSight Peripheral Identification 2 Register</description>
               <addressOffset>0x1FE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000A</resetValue>
               <fields>
                  <field>
                     <name>DES1</name>
                     <description>CoreSight JEP106 Identification Code Bits [6:4]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JEDEC</name>
                     <description>CoreSight JEDEC Assignment</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>CoreSight Revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID3</name>
               <description>CoreSight Peripheral Identification 3 Register</description>
               <addressOffset>0x1FEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMOD</name>
                     <description>CoreSight Custom Modifier 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>CoreSight REVAND</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID0</name>
               <description>CoreSight Component Identification 0 Register</description>
               <addressOffset>0x1FF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PRMBL0</name>
                     <description>CoreSight Preamble 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID1</name>
               <description>CoreSight Component Identification 1 Register</description>
               <addressOffset>0x1FF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>PRMBL1</name>
                     <description>CoreSight Preamble 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCLASS</name>
                     <description>CoreSight Component Class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID2</name>
               <description>CoreSight Component Identification 2 Register</description>
               <addressOffset>0x1FF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>PRMBL2</name>
                     <description>CoreSight Preamble 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID3</name>
               <description>CoreSight Component Identification 3 Register</description>
               <addressOffset>0x1FFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PRMBL3</name>
                     <description>CoreSight Preamble 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
