Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00100.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EIC</name>
         <version>037061b0</version>
         <description>External Interrupt Controller</description>
         <baseAddress>0x44020000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x44</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>EIC_EXTINT0</name>
            <value>16</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT1</name>
            <value>17</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT2</name>
            <value>18</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT3</name>
            <value>19</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT4</name>
            <value>20</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT5</name>
            <value>21</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT6</name>
            <value>22</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT7</name>
            <value>23</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT8</name>
            <value>24</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT9</name>
            <value>25</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT10</name>
            <value>26</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT11</name>
            <value>27</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT12</name>
            <value>28</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT13</name>
            <value>29</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT14</name>
            <value>30</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT15</name>
            <value>31</value>
         </interrupt>
         <interrupt>
            <name>EIC_NSCHK</name>
            <value>32</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKSEL</name>
                     <description>Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CKSELSelect</name>
                        <enumeratedValue>
                           <name>CLK_GCLK</name>
                           <description>Clocked by GCLK</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_ULP32K</name>
                           <description>Clocked by ULP32K</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMICTRL</name>
               <description>Non-Maskable Interrupt Control</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>NMISENSE</name>
                     <description>Non-Maskable Interrupt Sense Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>NMISENSESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising-edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling-edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both-edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High-level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low-level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMIFILTEN</name>
                     <description>Non-Maskable Interrupt Filter Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMIASYNCH</name>
                     <description>Asynchronous Edge Detection Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NMIASYNCHSelect</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIFLAG</name>
               <description>Non-Maskable Interrupt Flag Status and Clear</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>NMI</name>
                     <description>Non-Maskable Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchronization Busy Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Synchronization Busy Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINTEO</name>
                     <description>External Interrupt Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-secure Check Interrupt Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-secure Check Interrupt Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-secure Check Interrupt</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASYNCH</name>
               <description>External Interrupt Asynchronous Mode</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ASYNCH</name>
                     <description>Asynchronous Edge Detection Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCHSelect</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>EIC_EXTINTx edge detection is synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>EIC_EXTINTx edge detection is asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
