Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00100.svd
            <register>
               <name>CRP</name>
               <description>CFM Page Read Protection REGISTER (CFM8)</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <resetValue>0x00C20000</resetValue>
               <fields>
                  <field>
                     <name>BC1ARP</name>
                     <description>Panel 1 Read Protect BootCfg1A</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BC1ARPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Read Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UO1RP</name>
                     <description>Panel 1 Read Protect UserOTP1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UO1RPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BC1RP</name>
                     <description>Panel 1 Read Protect BootCfg1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BC1RPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Read Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCRP</name>
                     <description>Panel 1 Read Protect ROMCfg</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCRPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Read Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VSSRP0</name>
                     <description>Panel 1 Read Protect VSSn</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VSSRP0Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Read Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VSSRP1</name>
                     <description>Panel 1 Read Protect VSSn</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VSSRP1Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Read Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRP</name>
                     <description>Panel 1 Read Protect Test</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TRPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Read Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CORP</name>
                     <description>Panel 1 Read Protect CalOTP</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Read Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BC1ARPLOCK</name>
                     <description>Panel 1 Lock Read Protection BootCfg1A</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BC1ARPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UO1RPLOCK</name>
                     <description>Panel 1 Lock Read Protection UserOTP1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UO1RPLOCKSelect</name>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BC1RPLOCK</name>
                     <description>Panel 1 Lock Read Protection BootCfg1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BC1RPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCRPLOCK</name>
                     <description>Panel 1 Lock Read Protection ROMCfg</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCRPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VSSRPLOCK0</name>
                     <description>Panel 1 Lock Read Protection VSSn</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VSSRPLOCK0Select</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VSSRPLOCK1</name>
                     <description>Panel 1 Lock Read Protection VSSn</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VSSRPLOCK1Select</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRPLOCK</name>
                     <description>Panel 1 Lock Read Protection Test</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TRPLOCKSelect</name>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CORPLOCK</name>
                     <description>Panel 1 Lock Read Protection CalOTP</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORPLOCKSelect</name>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
