Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00100.svd
            <register>
               <name>LBWP</name>
               <description>Lower BFM Write Protect REGISTER</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>LBWP</name>
                     <description>Lower Boot Pages Write Protect Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>LBWPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Lower Boot Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Lower Boot Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LBWPLOCK</name>
                     <description>LBWP Lock Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LBWPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>This register is NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>This register is Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>UBWP</name>
               <description>Upper BFM Write Protect REGISTER</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>UBWP</name>
                     <description>Upper Boot Pages Write Protect Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>UBWPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Upper Boot Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Upper Boot Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UBWPLOCK</name>
                     <description>UBWP Lock Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UBWPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>This register is NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>This register is Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>UOWP</name>
               <description>User OTP Write protection REGISTER</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x0000000F</resetValue>
               <fields>
                  <field>
                     <name>UO1WPR</name>
                     <description>User OTP Page 1 Write Protect Row Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>UO1WPRSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Write Protection for User OTP Page 1 Row 'n' is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Write Protection for User OTP Page 1 Row 'n' is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UO1WPRLOCK</name>
                     <description>User OTP Page 1 WP Row Lock Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>UO1WPRLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>UO1WPR[n] &amp;amp; UO1WPRLOCK[n] bits are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>UO1WPR[n] &amp;amp; UO1WPRLOCK[n] bits are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CWP</name>
               <description>CFM Page Write Protect REGISTER</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <resetValue>0x08C008FD</resetValue>
               <fields>
                  <field>
                     <name>BC1AWP</name>
                     <description>Panel 1 Write Protect BootCfg1A</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BC1AWPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BC1WP</name>
                     <description>Panel 1 Write Protect BootCfg1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BC1WPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCWP</name>
                     <description>Panel 1 Write Protect ROMCfg</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCWPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VSSWP0</name>
                     <description>Panel 1 Write Protect VSSn</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VSSWP0Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VSSWP1</name>
                     <description>Panel 1 Write Protect VSSn</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VSSWP1Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TWP</name>
                     <description>Panel 1 Write Protect Test</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TWPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Page is Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COWP</name>
                     <description>Panel 1 Write Protect CalOTP</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>COWPSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Erase and Write Protection for this Page is Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Erase and Write Protection for this Page is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BC1AWPLOCK</name>
                     <description>Panel 1 Lock Write Protection BootCfg1A</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BC1AWPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BC1WPLOCK</name>
                     <description>Panel 1 Lock Write Protection BootCfg1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BC1WPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCWPLOCK</name>
                     <description>Panel 1 Lock Write Protection ROMCfg</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCWPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VSSWPLOCK0</name>
                     <description>Panel 1 Lock Write Protection VSSn</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VSSWPLOCK0Select</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VSSWPLOCK1</name>
                     <description>Panel 1 Lock Write Protection VSSn</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VSSWPLOCK1Select</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TWPLOCK</name>
                     <description>Panel 1 Lock Write Protection Test</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TWPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COWPLOCK</name>
                     <description>Panel 1 Lock Write Protection CalOTP</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>COWPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
