Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00100.svd
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STOP</name>
                     <description>Stop</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDX</name>
                     <description>Ramp</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UFS</name>
                     <description>Non-recoverable Update Fault State</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFS</name>
                     <description>Non-Recoverable Debug Fault State</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLAVE</name>
                     <description>Slave</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PATTBUFV</name>
                     <description>Pattern Buffer Valid</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERBUFV</name>
                     <description>Period Buffer Valid</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULTAIN</name>
                     <description>Recoverable Fault A Input</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULTBIN</name>
                     <description>Recoverable Fault B Input</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULT0IN</name>
                     <description>Non-Recoverable Fault0 Input</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULT1IN</name>
                     <description>Non-Recoverable Fault1 Input</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULTA</name>
                     <description>Recoverable Fault A State</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULTB</name>
                     <description>Recoverable Fault B State</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULT0</name>
                     <description>Non-Recoverable Fault 0 State</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAULT1</name>
                     <description>Non-Recoverable Fault 1 State</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCBUFV0</name>
                     <description>Compare Channel 0 Buffer Valid</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCBUFV1</name>
                     <description>Compare Channel 1 Buffer Valid</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP0</name>
                     <description>Compare Channel 0 Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1</name>
                     <description>Compare Channel 1 Value</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT</name>
               <description>Count</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT_DITH4_MODE</name>
               <description>Count</description>
               <alternateRegister>COUNT</alternateRegister>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Counter Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT_DITH5_MODE</name>
               <description>Count</description>
               <alternateRegister>COUNT</alternateRegister>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Counter Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT_DITH6_MODE</name>
               <description>Count</description>
               <alternateRegister>COUNT</alternateRegister>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Counter Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAVE</name>
               <description>Waveform Control</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WAVEGEN</name>
                     <description>Waveform Generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>WAVEGENSelect</name>
                        <enumeratedValue>
                           <name>NFRQ</name>
                           <description>Normal frequency</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MFRQ</name>
                           <description>Match frequency</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NPWM</name>
                           <description>Normal PWM</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DPWM</name>
                           <description>Dual compare PWM</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSCRITICAL</name>
                           <description>Dual-slope critical</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSBOTTOM</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSBOTH</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSTOP</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches TOP</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RAMP</name>
                     <description>Ramp Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RAMPSelect</name>
                        <enumeratedValue>
                           <name>RAMP1</name>
                           <description>RAMP1 operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2A</name>
                           <description>Alternative RAMP2 operation</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2</name>
                           <description>RAMP2 operation</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2C</name>
                           <description>Critical RAMP2 operation</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2CS</name>
                           <description>Critical Swapped RAMP2 operation</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIPEREN</name>
                     <description>Circular period Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCEN0</name>
                     <description>Circular Channel 0 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCEN1</name>
                     <description>Circular Channel 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL0</name>
                     <description>Channel 0 Polarity</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL1</name>
                     <description>Channel 1 Polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER</name>
               <description>Period</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER_DITH4_MODE</name>
               <description>Period</description>
               <alternateRegister>PER</alternateRegister>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER_DITH5_MODE</name>
               <description>Period</description>
               <alternateRegister>PER</alternateRegister>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER_DITH6_MODE</name>
               <description>Period</description>
               <alternateRegister>PER</alternateRegister>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC[%s]</name>
               <description>Compare and Capture</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare/Capture Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC_DITH4_MODE[%s]</name>
               <description>Compare and Capture</description>
               <alternateRegister>CC[%s]</alternateRegister>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare/Capture Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC_DITH5_MODE[%s]</name>
               <description>Compare and Capture</description>
               <alternateRegister>CC[%s]</alternateRegister>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare/Capture Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC_DITH6_MODE[%s]</name>
               <description>Compare and Capture</description>
               <alternateRegister>CC[%s]</alternateRegister>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare/Capture Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF</name>
               <description>Period Buffer</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF_DITH4_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERBUF</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF_DITH5_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERBUF</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF_DITH6_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERBUF</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
