Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00100.svd
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF[%s]</name>
               <description>Compare and Capture Buffer</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH4_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH5_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH6_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC1</name>
         <baseAddress>0x44812000</baseAddress>
         <interrupt>
            <name>TCC1_DFS</name>
            <value>92</value>
         </interrupt>
         <interrupt>
            <name>TCC1_CNT</name>
            <value>93</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC0</name>
            <value>94</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC1</name>
            <value>95</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC2</name>
         <baseAddress>0x44814000</baseAddress>
         <interrupt>
            <name>TCC2_DFS</name>
            <value>96</value>
         </interrupt>
         <interrupt>
            <name>TCC2_CNT</name>
            <value>97</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC0</name>
            <value>98</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC1</name>
            <value>99</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC3</name>
         <baseAddress>0x44816000</baseAddress>
         <interrupt>
            <name>TCC3_DFS</name>
            <value>100</value>
         </interrupt>
         <interrupt>
            <name>TCC3_CNT</name>
            <value>101</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC0</name>
            <value>102</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC1</name>
            <value>103</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC4</name>
         <baseAddress>0x44824000</baseAddress>
         <interrupt>
            <name>TCC4_DFS</name>
            <value>118</value>
         </interrupt>
         <interrupt>
            <name>TCC4_CNT</name>
            <value>119</value>
         </interrupt>
         <interrupt>
            <name>TCC4_MC0</name>
            <value>120</value>
         </interrupt>
         <interrupt>
            <name>TCC4_MC1</name>
            <value>121</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC5</name>
         <baseAddress>0x44826000</baseAddress>
         <interrupt>
            <name>TCC5_DFS</name>
            <value>122</value>
         </interrupt>
         <interrupt>
            <name>TCC5_CNT</name>
            <value>123</value>
         </interrupt>
         <interrupt>
            <name>TCC5_MC0</name>
            <value>124</value>
         </interrupt>
         <interrupt>
            <name>TCC5_MC1</name>
            <value>125</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC6</name>
         <baseAddress>0x44828000</baseAddress>
         <interrupt>
            <name>TCC6_DFS</name>
            <value>126</value>
         </interrupt>
         <interrupt>
            <name>TCC6_CNT</name>
            <value>127</value>
         </interrupt>
         <interrupt>
            <name>TCC6_MC0</name>
            <value>128</value>
         </interrupt>
         <interrupt>
            <name>TCC6_MC1</name>
            <value>129</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>USB</name>
         <version>036131d0</version>
         <description>Full-Speed Universal Serial Bus</description>
         <baseAddress>0x44832000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x200</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>USB_EORSMDNRSM</name>
            <value>134</value>
         </interrupt>
         <interrupt>
            <name>USB_SOFHSOF</name>
            <value>135</value>
         </interrupt>
         <interrupt>
            <name>USB_TRCPT00</name>
            <value>136</value>
         </interrupt>
         <interrupt>
            <name>USB_TRCPT10</name>
            <value>137</value>
         </interrupt>
         <registers>
            <cluster>
               <name>DEVICE</name>
               <description>USB is Device</description>
               <headerStructName>UsbDevice</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>DEVICE</name>
                              <description>Device Mode</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HOST</name>
                              <description>Host Mode</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>Synchronization Busy</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>QOSCTRL</name>
                  <description>USB Quality Of Service</description>
                  <addressOffset>0x3</addressOffset>
                  <size>8</size>
                  <resetValue>0x0F</resetValue>
                  <fields>
                     <field>
                        <name>CQOS</name>
                        <description>Configuration Quality of Service</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>DQOS</name>
                        <description>Data Quality of Service</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>DEVICE Control B</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <resetValue>0x0001</resetValue>
                  <fields>
                     <field>
                        <name>DETACH</name>
                        <description>Detach</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPDCONF</name>
                        <description>Speed Configuration</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPDCONFSelect</name>
                           <enumeratedValue>
                              <name>FS</name>
                              <description>FS : Full Speed</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LS</name>
                              <description>LS : Low Speed</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>HS : High Speed capable</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HSTM</name>
                              <description>HSTM: High Speed Test Mode (force high-speed mode for test mode)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>NREPLY</name>
                        <description>No Reply</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTJ</name>
                        <description>Test mode J</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTK</name>
                        <description>Test mode K</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTPCKT</name>
                        <description>Test packet mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OPMODE2</name>
                        <description>Specific Operational Mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GNAK</name>
                        <description>Global NAK</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMHDSK</name>
                        <description>Link Power Management Handshake</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LPMHDSKSelect</name>
                           <enumeratedValue>
                              <name>NO</name>
                              <description>No handshake. LPM is not supported</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACK</name>
                              <description>ACK</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NYET</name>
                              <description>NYET</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STALL</name>
                              <description>STALL</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DADD</name>
                  <description>DEVICE Device Address</description>
                  <addressOffset>0xA</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DADD</name>
                        <description>Device Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>ADDEN</name>
                        <description>Device Address Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>DEVICE Status</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x40</resetValue>
                  <fields>
                     <field>
                        <name>SPEED</name>
                        <description>Speed Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>FS</name>
                              <description>Full-speed mode</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LS</name>
                              <description>Low-speed mode</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>High-speed mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LINESTATE</name>
                        <description>USB Line State Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LINESTATESelect</name>
                           <enumeratedValue>
                              <name>0</name>
                              <description>SE0/RESET</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>FS-J or LS-K State</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2</name>
                              <description>FS-K or LS-J State</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSMSTATUS</name>
                  <description>Finite State Machine Status</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>FSMSTATE</name>
                        <description>Fine State Machine Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                        <enumeratedValues>
                           <name>FSMSTATESelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>OFF (L3). It corresponds to the powered-off, disconnected, and disabled state</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ON</name>
                              <description>ON (L0). It corresponds to the Idle and Active states</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>SUSPEND (L2)</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLEEP</name>
                              <description>SLEEP (L1)</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DNRESUME</name>
                              <description>DNRESUME. Down Stream Resume.</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPRESUME</name>
                              <description>UPRESUME. Up Stream Resume.</description>
                              <value>0x20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESET</name>
                              <description>RESET. USB lines Reset.</description>
                              <value>0x40</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
